.config/doom/config.org
#+TITLE: rogs DOOM Emacs config
#+AUTHOR: Roger Gonzalez (rogs)
#+DESCRIPTION: rogs personal Doom Emacs config.

* Introduction
:PROPERTIES:
:ID:       4e8ec984-b517-4e34-b018-7464650b2b9f
:END:

This configuration represents my personal Doom Emacs setup, focused on productivity, organization with Org-mode, and programming. The file is organized into logical sections, starting with basic settings, then appearance, followed by major functionality areas like Org-mode and programming language support.

Key principles in this configuration:
- Prioritize keyboard-driven workflows
- Integrate personal productivity systems through Org-mode
- Optimize for both writing and coding tasks

This document serves both as configuration and as documentation. Each section explains not just what the code does, but why it's important to my workflow. If you're new to Doom Emacs, you can use this as a reference for setting up your own configuration.

To navigate this file efficiently:
- Use `SPC n s` to search for specific settings
- Use `TAB` on headings to expand/collapse sections
- Look for the explanatory text before each code block

* Basic configuration
:PROPERTIES:
:ID:       4e8ec984-b517-4e34-b018-7464650b2b9f
:END:

This section contains fundamental identity settings that are used by various Emacs packages, particularly for version control systems like Git and for email clients. These settings ensure that my contributions are properly attributed.

First off, set my user and email
#+begin_src emacs-lisp
(setq user-full-name "Roger Gonzalez"
      user-mail-address "roger@rogs.me")
#+end_src

* Look and feel
:PROPERTIES:
:ID:       0b198a7a-c736-4dd4-84a3-0ea21bcdc4fb
:END:

This section configures the visual aspects of my Emacs experience. I prefer a clean, distraction-free interface with a dark theme that's easy on the eyes during long coding sessions. Font choices prioritize readability and support for programming ligatures.

** Fonts
:PROPERTIES:
:ID:       b4df4ef4-d0ca-4047-90b3-f4128425aa9f
:END:

This works only in Linux. On MacOS we keep the default fonts.

#+begin_src emacs-lisp
(if (not (eq system-type 'darwin))
    (progn
      (setq doom-font (font-spec :family "MesloLGS Nerd Font" :size 14)
            doom-variable-pitch-font (font-spec :family "sans")
            doom-big-font (font-spec :family "MesloLGS Nerd Font" :size 24))))
#+end_src

** Theme
:PROPERTIES:
:ID:       3bae130e-3336-4bc7-9378-82c315e2aea6
:END:

#+begin_src emacs-lisp
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
(setq doom-theme 'doom-badger)
(setq fancy-splash-image "~/.config/doom/logo.png")
#+end_src

** Misc
:PROPERTIES:
:ID:       cf3c202b-7610-4038-8e15-654a95a9d1dc
:END:

*** Display relative numbers on the buffer
:PROPERTIES:
:ID:       6a510691-0b78-44b8-ab92-518971051d8a
:END:
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

* Org Mode + Org Roam
:PROPERTIES:
:ID:       96b93a81-3272-4f7a-a667-8a8783849d64
:END:

The cornerstone of my productivity system. My entire life is managed through Org Mode and Org Roam, from task management and note-taking to project planning and knowledge management. This extensive configuration reflects years of refinement to match my personal workflow.

The setup includes custom agenda views, capture templates, and todo states that implement a GTD-inspired system with my own modifications for different types of tasks and projects.

Key components of this system:
- Custom TODO states that reflect my workflow (NEXT, WAITING, SOMEDAY, etc.)
- Visual styling to quickly identify task states and priorities
- Capture templates for different types of information
- Custom agenda views for different perspectives on my tasks
- Recurring task handling with org-recur
- ID-based linking for creating a personal knowledge graph

This section is organized into logical subsections, each focusing on a specific aspect of the Org Mode configuration. The most frequently used features are placed earlier in the file.

** Set the directory
:PROPERTIES:
:ID:       99cbc04c-604c-4427-94fc-aa0603c78809
:END:

#+begin_src emacs-lisp
(setq org-directory "~/org/")
(setq org-roam-directory "~/roam/")
#+end_src

** Basic Org Setup
:PROPERTIES:
:ID:       37915445-e875-4da0-bab0-3f8f8b8e89f5
:END:

This section contains the foundational settings for Org mode, including directory paths and basic behavior.

#+begin_src emacs-lisp
(after! org
  ;; Include diary
  (setq org-agenda-include-diary t)

  ;; Enforce ordered tasks
  (setq org-enforce-todo-dependencies t)
  (setq org-enforce-todo-checkbox-dependencies t)
  (setq org-track-ordered-property-with-tag t)

  ;; Text formatting
  (add-hook 'org-mode-hook #'auto-fill-mode)
  (setq-default fill-column 105)

  ;; Save all org buffers on each save
  (add-hook 'auto-save-hook 'org-save-all-org-buffers)
  (add-hook 'after-save-hook 'org-save-all-org-buffers)
  (require 'org-download)
  (add-hook 'dired-mode-hook 'org-download-enable)
  (add-hook 'org-mode-hook 'org-auto-tangle-mode))
#+end_src

** Task Management
:PROPERTIES:
:ID:       37915445-e875-4da0-bab0-3f8f8b8e89f6
:END:

Configuration for task tracking, including TODO keywords, priorities, and logging behavior. This implements a GTD-inspired workflow with custom states to track different stages of task completion.

The TODO keywords are carefully chosen to represent distinct states in my workflow:
- REPEAT: Tasks that recur on a schedule
- NEXT: The immediate next actions I should focus on
- DELEGATED: Tasks I've assigned to someone else
- TODO: Standard tasks that need to be done
- WAITING: Tasks blocked by external factors
- SOMEDAY: Ideas or tasks for future consideration
- PROJ: Project containers that group related tasks

Priorities follow a simple decision matrix:
- A: Do it now (urgent and important)
- B: Decide when to do it (important but not urgent)
- C: Delegate it (urgent but not important)
- D: Just an idea (neither urgent nor important)

The logging configuration ensures I maintain a history of state changes, completion times, and notes about rescheduling.

#+begin_src emacs-lisp
(after! org
  ;; Logs
  (setq org-log-state-notes-insert-after-drawers nil
        org-log-into-drawer "LOGBOOK"
        org-log-done 'time
        org-log-repeat 'time
        org-log-redeadline 'note
        org-log-reschedule 'note)

  ;; TODO keywords and states
  (setq-default org-todo-keywords
                '((sequence "REPEAT(r)" "NEXT(n@/!)" "DELEGATED(e@/!)" "TODO(t@/!)"
                            "WAITING(w@/!)" "SOMEDAY(s@/!)" "PROJ(p)" "|"
                            "DONE(d@)" "CANCELLED(c@/!)" "FORWARDED(f@)")))

  ;; Priorities configuration
  ;; A: Do it now
  ;; B: Decide when to do it
  ;; C: Delegate it
  ;; D: Just an idea
  (setq org-highest-priority ?A)
  (setq org-lowest-priority ?D)
  (setq org-default-priority ?B))
#+end_src

** Visual Styling
:PROPERTIES:
:ID:       37915445-e875-4da0-bab0-3f8f8b8e89f7
:END:

Visual appearance settings for Org mode, including fonts, colors, and formatting.

#+begin_src emacs-lisp
(after! org
  ;; TODO keyword faces
  (setq-default org-todo-keyword-faces
                '(("REPEAT" . (:foreground "white" :background "indigo" :weight bold))
                  ("NEXT" . (:foreground "red" :background "orange" :weight bold))
                  ("DELEGATED" . (:foreground "white" :background "blue" :weight bold))
                  ("TODO" . (:foreground "white" :background "violet" :weight bold))
                  ("WAITING" (:foreground "white" :background "#A9BE00" :weight bold))
                  ("SOMEDAY" . (:foreground "white" :background "#00807E" :weight bold))
                  ("PROJ" . (:foreground "white" :background "deeppink3" :weight bold))
                  ("DONE" . (:foreground "white" :background "forest green" :weight bold))
                  ("CANCELLED" . (:foreground "light gray" :slant italic))
                  ("FORWARDED" . (:foreground "light gray" :slant italic))))

  ;; Priority faces
  (setq org-priority-faces '((?A . (:foreground "white" :background "dark red" :weight bold))
                             (?B . (:foreground "white" :background "dark green" :weight bold))
                             (?C . (:foreground "yellow"))
                             (?D . (:foreground "gray"))))

  ;; Headline styling
  (setq org-fontify-done-headline t)
  (setq org-fontify-todo-headline t)

  ;; Org bullets for prettier headings
  (require 'org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+end_src

** Capture Templates
:PROPERTIES:
:ID:       37915445-e875-4da0-bab0-3f8f8b8e89f8
:END:

Templates for quickly capturing various types of information into Org mode.

#+begin_src emacs-lisp
(after! org
  (setq org-capture-templates
        (quote
         (("G" "Define a goal" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/goal.org") :empty-lines-after 1)
          ("R" "REPEAT entry" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/repeat.org") :empty-lines-before 1)
          ("N" "NEXT entry" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/next.org") :empty-lines-before 1)
          ("T" "TODO entry" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/todo.org") :empty-lines-before 1)
          ("W" "WAITING entry" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/waiting.org") :empty-lines-before 1)
          ("S" "SOMEDAY entry" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/someday.org") :empty-lines-before 1)
          ("P" "PROJ entry" entry (file+headline "~/org/capture.org" "Capture")
           (file "~/org/templates/proj.org") :empty-lines-before 1)
          ("B" "Book on the to-read-list" entry (file+headline "~/org/private.org" "Libros para leer")
           (file "~/org/templates/book.org") :empty-lines-after 2)
          ("p" "Create a daily plan")
          ("pP" "Daily plan private" plain (file+olp+datetree "~/org/plan-free.org")
           (file "~/org/templates/dailyplan.org") :immediate-finish t :jump-to-captured t)
          ("pL" "Daily plan Lazer" plain (file+olp+datetree "~/org/plan-lazer.org")
           (file "~/org/templates/dailyplan.org") :immediate-finish t :jump-to-captured t)
          ("j" "Journal entry")
          ("jP" "Journal entry private" entry (file+olp+datetree "~/org/journal-private.org")
           "** %U - %^{Heading}")
          ("jL" "Journal entry Lazer" entry (file+olp+datetree "~/org/journal-lazer.org")
           "** %U - %^{Heading}")))))
#+end_src

