.config/doom/config.org
** LSP
:PROPERTIES:
:ID:       84836840-8642-46ad-8068-dc07086708f3
:END:

#+begin_src emacs-lisp
(after! lsp-mode
  (setq lsp-headerline-breadcrumb-enable t)
  (setq lsp-headerline-breadcrumb-icons-enable t))
#+end_src

** Python
:PROPERTIES:
:ID:       8f3279cf-53e2-4fe5-b30b-724d2d081cbe
:END:

#+begin_src emacs-lisp
(after! python
  :init
  (require 'auto-virtualenv)
 (setq auto-virtualenv-global-dirs
      '("~/.virtualenvs/" "~/.pyenv/versions/" "~/.envs/" "~/.conda/" "~/.conda/envs/" "./.venv"))
  (add-hook 'python-mode-hook 'auto-virtualenv-setup)
  (setq enable-local-variables :all)
  (setq poetry-tracking-strategy 'projectile)
  (setq cov-coverage-mode t)
  (add-hook 'python-mode-hook 'cov-mode))
#+end_src
** Groovy
:PROPERTIES:
:ID:       8f8956c2-a7a3-4508-8f30-dc7a2f5e105b
:END:

#+begin_src emacs-lisp
(after! groovy-mode
  (define-key groovy-mode-map (kbd "<f4>") 'my/jenkins-verify))
#+end_src

** Go
:PROPERTIES:
:ID:       ee0c0fc1-7801-45ba-9302-73a78ce3d329
:END:

#+begin_src emacs-lisp
(setq lsp-go-analyses '((shadow . t)
                        (simplifycompositelit . :json-false)))
#+end_src

** RestClient
:PROPERTIES:
:ID:       cf97ccd8-7023-48f0-8273-a1a64fad3fd0
:END:
#+begin_src emacs-lisp
(setq restclient-same-buffer-response nil)
#+end_src

* Custom
:PROPERTIES:
:ID:       cd8a28bd-d91f-4ba8-b637-cb542ff5cca4
:END:

Here's where custom functionalities get configured.

** Custom packages
:PROPERTIES:
:ID:       483ed79c-9eba-4544-8333-dda0139e9a08
:END:

These are additional packages that aren't part of the standard Doom modules but that I find essential for my workflow:

  | Package name    | Description                                    | URL                                     |
  |-----------------+------------------------------------------------+-----------------------------------------|
  | ~screenshot.el~ | Good for taking screenshots directly in Emacs. | https://github.com/tecosaur/screenshot  |
  | ~private.el~    | This is a file for private values and API keys that shouldn't be in version control. | ~./custom-packages/private.el.example~. |

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/doom/custom-packages")

(require 'screenshot)
(require 'private)
#+end_src

** Custom functions
:PROPERTIES:
:ID:       0888b2db-9a0d-463d-89ad-371fcbfa0473
:END:
*** Update DOOM Emacs init.el file
:PROPERTIES:
:ID:       af485cc4-be52-4bb4-889d-7de8bea1ed66
:END:

This function brings up a comparison between the current ~init.el~ file and the example file
(~templates/init.example.el~). Very useful for upgrading manually.

More info here: https://github.com/doomemacs/doomemacs/issues/581#issuecomment-645448095

#+begin_src emacs-lisp
(defun my/ediff-init-and-example ()
  "Compare init.el with the example init file."
  (interactive)
  (let ((init-file (concat doom-user-dir "init.el"))
        (example-file (concat doom-emacs-dir "templates/init.example.el")))
    (if (and (file-exists-p init-file)
             (file-exists-p example-file))
        (ediff-files init-file example-file)
      (message "Cannot find init.el or example file"))))

(define-key! help-map "di"   #'my/ediff-init-and-example)
#+end_src
*** HTTP Statuses
:PROPERTIES:
:ID:       3fa9d843-f163-4f04-8129-918fb57603a4
:END:

This is a custom helm command that displays all the HTTP status codes with their descriptions. As a developer working with web APIs, I frequently need to reference these codes. This function provides a quick, searchable reference without leaving Emacs or disrupting my workflow.

Usage: `M-x helm-httpstatus` or through the applications menu with `SPC a h`

#+begin_src emacs-lisp
(defvar helm-httpstatus-source
  '((name . "HTTP STATUS")
    (candidates . (("100 Continue") ("101 Switching Protocols")
                   ("102 Processing") ("200 OK")
                   ("201 Created") ("202 Accepted")
                   ("203 Non-Authoritative Information") ("204 No Content")
                   ("205 Reset Content") ("206 Partial Content")
                   ("207 Multi-Status") ("208 Already Reported")
                   ("300 Multiple Choices") ("301 Moved Permanently")
                   ("302 Found") ("303 See Other")
                   ("304 Not Modified") ("305 Use Proxy")
                   ("307 Temporary Redirect") ("400 Bad Request")
                   ("401 Unauthorized") ("402 Payment Required")
                   ("403 Forbidden") ("404 Not Found")
                   ("405 Method Not Allowed") ("406 Not Acceptable")
                   ("407 Proxy Authentication Required") ("408 Request Timeout")
                   ("409 Conflict") ("410 Gone")
                   ("411 Length Required") ("412 Precondition Failed")
                   ("413 Request Entity Too Large")
                   ("414 Request-URI Too Large")
                   ("415 Unsupported Media Type")
                   ("416 Request Range Not Satisfiable")
                   ("417 Expectation Failed") ("418 I'm a teapot")
                   ("421 Misdirected Request")
                   ("422 Unprocessable Entity") ("423 Locked")
                   ("424 Failed Dependency") ("425 No code")
                   ("426 Upgrade Required") ("428 Precondition Required")
                   ("429 Too Many Requests")
                   ("431 Request Header Fields Too Large")
                   ("449 Retry with") ("500 Internal Server Error")
                   ("501 Not Implemented") ("502 Bad Gateway")
                   ("503 Service Unavailable") ("504 Gateway Timeout")
                   ("505 HTTP Version Not Supported")
                   ("506 Variant Also Negotiates")
                   ("507 Insufficient Storage") ("509 Bandwidth Limit Exceeded")
                   ("510 Not Extended")
                   ("511 Network Authentication Required")))
    (action . message)))

(defun helm-httpstatus ()
  (interactive)
  (helm-other-buffer '(helm-httpstatus-source) "*helm httpstatus*"))
#+end_src

*** Convert HTML to org
:PROPERTIES:
:ID:       b81dff7f-9bc5-4601-97fe-6c2b9e78366c
:END:

This function converts clipboard contents from HTML to Org format and then pastes (yanks) the result. It's extremely useful when researching online and wanting to capture formatted content directly into my org notes without losing structure.

Dependencies:
- ~pandoc~ for the format conversion
- ~xclip~ for clipboard access

Usage: Press F4 in any org-mode buffer to convert and paste HTML from clipboard

#+begin_src emacs-lisp
(defun my/html2org-clipboard ()
  "Convert HTML in clipboard to Org format and paste it."
  (interactive)
  (condition-case err
      (progn
        (kill-new (shell-command-to-string
                   "timeout 1 xclip -selection clipboard -o -t text/html | pandoc -f html -t json | pandoc -f json -t org --wrap=none"))
        (yank)
        (message "Pasted HTML in org"))
    (error (message "Error converting HTML to Org: %s" (error-message-string err)))))
(after! org
  (define-key org-mode-map (kbd "<f4>") 'my/html2org-clipboard))
#+end_src
*** My own menu
:PROPERTIES:
:ID:       60a0316f-8bb8-40fe-af45-e42cdb6da60a
:END:

This is a custom menu for my own functions

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("a" . "applications")
       :desc "HTTP Status cheatsheet" "h" #'helm-httpstatus)
      (:prefix-map ("ao" . "org")
       :desc "Org focus Lazer" "l" #'org-focus-lazer
       :desc "Org focus private" "p" #'org-focus-private
       :desc "Org focus all" "a" #'org-focus-all
      ))
#+end_src
* Misc
:PROPERTIES:
:ID:       b57fe5fe-18ce-4215-ba94-8deee3a2b64f
:END:
** Clipmon
:PROPERTIES:
:ID:       7b6776af-f357-4f87-9850-4eae4f8daa76
:END:

Clipmon serves as my clipboard manager within Emacs. I chose it over alternatives like ~helm-clipboard~ because it offers better integration with my workflow and provides automatic monitoring of clipboard changes. This allows me to maintain a history of copied text without manual intervention.

The configuration below sets up Clipmon to check the clipboard every second and makes the kill ring accessible through M-y with helm integration.

#+begin_src emacs-lisp
;; Ensure clipmon is loaded
(require 'clipmon)

(after! clipmon
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (add-to-list 'after-init-hook 'clipmon-mode-start)
  (defadvice clipmon--on-clipboard-change (around stop-clipboard-parsing activate)
    (let ((interprogram-cut-function nil)) ad-do-it))
  (setq clipmon-timer-interval 1))

#+end_src

** Git
:PROPERTIES:
:ID:       51176440-f985-4c90-94a7-bed48286272c
:END:
*** Set ~delta~ as the default magit diff
:PROPERTIES:
:ID:       fa6dc3cb-50d7-49cd-96cb-e91a122b1316
:END:

#+begin_src emacs-lisp
(add-hook 'magit-mode-hook (lambda () (magit-delta-mode +1)))
#+end_src

*** Accept pre-commit messages when creating git commits with magit-gptcommit mode
:PROPERTIES:
:ID:       2c8ead63-0929-4f52-9816-85d8e24b8123
:END:
#+begin_src emacs-lisp
(defun my/magit-gptcommit-commit-accept-wrapper (orig-fun &rest args)
  "Wrapper for magit-gptcommit-commit-accept to preserve original message."
  (when-let ((buf (magit-commit-message-buffer)))
    (with-current-buffer buf
      (let ((orig-message (string-trim-right (or (git-commit-buffer-message) "") "\n$")))
        (apply orig-fun args)
        (unless (string-empty-p orig-message)
          (save-excursion
            (goto-char (point-min))
            (insert orig-message)))))))

(advice-add 'magit-gptcommit-commit-accept
            :around #'my/magit-gptcommit-commit-accept-wrapper)
#+end_src

